package com.example.apple.jqjz.util;

/**
 * Created by apple on 17/4/30.
 */

public class Util {
    public static final String IP="192.168.1.102";
    public static final String LC_1="\t\t\t\t自装置外来的原料油进入原料缓冲罐，" +
            "经反应进料泵升压后与氢气混合，在混氢油/反应产物换热器与反应产物换" +
            "热到反应所需温度，进入加氢精制反应器，混氢油在反应器中催化剂的作用下，" +
            "进行加氢精制反应，在催化剂床层间设有控制反应温度的急冷氢。反应产物经混氢油/反应产物" +
            "换热器换热后进入反应产物空冷器进一步冷却，" +
            "冷却后的反应产物进入高压分离器进行气、油、水三相分离。为防止低温下铵盐结晶堵塞高" +
            "压空冷器，用高压注水泵将注水罐" + "中除盐水注入高压空冷器前作反应注水。"+"\n\r\t\t\t\t从" +
            "高压分离器" + "分离出来的气体，在循环氢缓冲罐中除液后，气体经循环氢压缩机升压后，一路作为急冷氢注入催化剂床层；" +
            "一路与自界外来的补充新氢混合，混合氢与原料油混合后，进入混氢油／反应产物换热器，返回反应系统。" +
            "高分油经减压后进入低压分离器，继续气、油、水三相分离。低分气经过减压后出装置。" +
            "高压分离器界控脱除的含硫污水减压后与低压分离器脱除的含硫污水汇合出装置至污水汽提装置处理。" +
            "低压分离器分离出来的低分气出装置。冷低分油通过自动阀控制液位后进入分馏塔进料加热炉。";
}
