package com.example.apple.jqjz.util;

/**
 * Created by apple on 17/4/30.
 */

public class Util {
    public static final String IP="192.168.1.102";
    public static final String LC_1="\t\t\t\t自装置外来的原料油进入原料缓冲罐，" +
            "经反应进料泵升压后与氢气混合，在混氢油/反应产物换热器与反应产物换" +
            "热到反应所需温度，进入加氢精制反应器，混氢油在反应器中催化剂的作用下，" +
            "进行加氢精制反应，在催化剂床层间设有控制反应温度的急冷氢。反应产物经混氢油/反应产物" +
            "换热器换热后进入反应产物空冷器进一步冷却，" +
            "冷却后的反应产物进入高压分离器进行气、油、水三相分离。为防止低温下铵盐结晶堵塞高" +
            "压空冷器，用高压注水泵将注水罐" + "中除盐水注入高压空冷器前作反应注水。"+"\n\r\t\t\t\t从" +
            "高压分离器" + "分离出来的气体，在循环氢缓冲罐中除液后，气体经循环氢压缩机升压后，一路作为急冷氢注入催化剂床层；" +
            "一路与自界外来的补充新氢混合，混合氢与原料油混合后，进入混氢油／反应产物换热器，返回反应系统。" +
            "高分油经减压后进入低压分离器，继续气、油、水三相分离。低分气经过减压后出装置。" +
            "高压分离器界控脱除的含硫污水减压后与低压分离器脱除的含硫污水汇合出装置至污水汽提装置处理。" +
            "低压分离器分离出来的低分气出装置。冷低分油通过自动阀控制液位后进入分馏塔进料加热炉。";
    public static final String LC_2="\t\t\t\t冷低分油经分馏塔进料加热炉加热至要求的温度，" +
            "之后进入分馏塔，在主分馏塔内实现分馏过程。分馏塔顶气相经分馏塔顶水冷器冷却后进入分馏塔顶回流罐" +
            "进行气液分离，气体去低压燃料气管网作燃料气；液体一部分经分馏塔顶回流泵送回分馏塔作塔顶回流，" +
            "另一部分作为精制石脑油出装置。"+"\n\r\t\t\t\t塔底精制柴油产品用精制柴油泵抽出送至产品油罐，产品油罐" +
            "中精制柴油经产品油泵升压后送出装置。"+"\n\r\t\t\t\t分馏塔顶回流罐都在水包中脱除含硫污水，同反应部分" +
            "脱除的含硫污水汇合后送出装置至污水汽提";
    public static final String COM_0="[P]-关原料油泵P2101出口阀XV106\n" +
            "[P]-开原料油泵P2101\n" +
            "[P]-开原料油泵P2101出口阀XV106\n" +
            "[P]-汇报主操“原料油泵P2101已开启，运行正常” \n" +
            "[P]-关脱盐水泵P2102出口阀XV120\n" +
            "[P]-开脱盐水泵P2102\n" +
            "[P]-开脱盐水泵P2102出口阀XV120\n" +
            "[P]-汇报主操“脱盐水泵P2102已开启，运行正常” \n" +
            "[P]-开循环氢压缩机K2101\n" +
            "[P]-汇报主操“循环氢压缩机K2101已开启，运行正常” \n" +
            "[P]-开反应产物空冷器A2101\n" +
            "[P]-汇报主操“反应产物空冷器A2101已开启，运行正常”\n" +
            "[P]-开加热炉鼓风机C-2201\n" +
            "[P]-汇报主操“加热炉鼓风机C-2201已开启，运行正常”\n" +
            "[I]-对分馏塔进料加热炉F-2201进行点火，并通知外操查看炉膛着火状态。\n" +
            "[P]-汇报主操“分馏塔进料加热炉F-2201已燃烧，燃烧状态正常”  \n" +
            "[P]-关分馏塔回流泵P2201出口阀XV221   \n" +
            "[P]-开分馏塔回流泵P2201\n" +
            "[P]-开分馏塔回流泵P2201出口阀XV221\n" +
            "[P]-汇报主操“分馏塔回流泵P2201已开启，运行正常” \n" +
            "[P]-关分馏塔底泵P2202出口阀XV226\n" +
            "[P]-开分馏塔底泵P2202\n" +
            "[P]-开分馏塔底泵P2202出口阀XV226\n" +
            "[P]-汇报主操“分馏塔底泵P2202已开启，运行正常” \n" +
            "[P]-关产品油泵P2203A出口阀XV234\n" +
            "[P]-开产品油泵P2203A\n" +
            "[P]-开产品油泵P2203A出口阀V234\n" +
            "[P]-汇报主操“产品油泵P2203A已开启，运行正常”";
    public static final String COM_1="[I]-关分馏塔进料加热炉F2201瓦斯进气自动阀TIV202\n" +
            "[I]-关分馏塔进料加热炉F2201进料自动阀LIV103\n" +
            "[P]-关分馏塔进料加热炉F2201瓦斯进气手阀XV205\n" +
            "[P]-关加热炉鼓风机C-2201\n" +
            "[P]-汇报主操“分馏塔进料加热炉F2201已停止，并隔离” \n" +
            "[I]-开分馏塔进料加热炉F2201消防蒸汽阀KIV202，向炉内通蒸汽\n" +
            "[I]-关分馏塔T2201塔底蒸汽自动阀TIV201\n" +
            "[P]-关汽提塔T2201塔底蒸汽手阀XV210\n" +
            "[P]-汇报主操“汽提塔T2201塔底蒸汽手阀XV210已关闭”\n" +
            "[I]-开低分油去事故池开关阀KIV104，低分油改去事故池\n" +
            "[P]-关分馏塔回流泵P2201出口阀XV221   \n" +
            "[P]-停分馏塔回流泵P2201\n" +
            "[P]-关分馏塔回流泵P2201进口阀XV220\n" +
            "[P]-汇报主操“分馏塔回流泵P2201已停止” \n" +
            "[P]-关分馏塔底泵P2202出口阀XV226\n" +
            "[P]-停分馏塔底泵P2202\n" +
            "[P]-关分馏塔底泵P2202进口阀XV225\n" +
            "[P]-汇报主操“分馏塔底泵P2202已停止”";
    public static final String COM_2="[P]-现场关闭分馏塔进料加热炉F-2201前燃料气手阀XV205 \n" +
            "[P]-关加热炉鼓风机C-2201\n" +
            "[P]-现场关闭分馏塔底蒸汽手阀XV210 \n" +
            "[P]-关原料油泵P2101出口阀XV106 \n" +
            "[P]-停原料油泵P2101 \n" +
            "[P]-关原料油泵P2101进口阀XV105 \n" +
            "[P]-汇报主操“原料油泵P2101已停止”  \n" +
            "[P]-关脱盐水泵P2102出口阀XV120  \n" +
            "[P]-停脱盐水泵P2102\n" +
            "[P]-关脱盐水泵P2102进口阀XV119\n" +
            "[P]-汇报主操“脱盐水泵P2101已停止” \n" +
            "[P]-关分馏塔回流泵P2201出口阀XV221   \n" +
            "[P]-停分馏塔回流泵P2201\n" +
            "[P]-关分馏塔回流泵P2201进口阀XV220\n" +
            "[P]-汇报主操“分馏塔回流泵P2201已停止” \n" +
            "[P]-关分馏塔底泵P2202出口阀XV226\n" +
            "[P]-停分馏塔底泵P2202\n" +
            "[P]-关分馏塔底泵P2202进口阀XV225\n" +
            "[P]-汇报主操“分馏塔底泵P2202已停止”";
    public static final String COM_3="[P]-停分馏塔底泵P2202\n" +
            "[P]-关分馏塔底阀XV225\n" +
            "[P]-打开消防蒸汽软管站蒸汽阀XV152用消防蒸汽带灭火\n" +
            "[P]-汇报主操“分馏塔底泵已关闭并隔离，明火已被扑灭”\n" +
            "[I]-关分馏塔进料加热炉F-2201瓦斯进气自动阀TIV202 \n" +
            "[P]-现场确认分馏炉停，并关闭分馏塔进料加热炉F-2201瓦斯进气手阀XV205\n" +
            "[P]-关加热炉鼓风机C-2201\n" +
            "[I]-关分馏塔T2201塔底蒸汽自动阀TIV201\n" +
            "[P]-关分馏塔T2201塔底蒸汽手阀XV210\n" +
            "[I]-开低分油去事故池开关阀KIV104，低分油改去事故池\n" +
            "[P]-关分馏塔回流泵P2201出口阀XV221   \n" +
            "[P]-停分馏塔回流泵P2201\n" +
            "[P]-关分馏塔回流泵P2201进口阀XV220\n" +
            "[P]-汇报主操“分馏塔回流泵P2201已停止”";
    public static final String COM_4="[I]-关分馏塔进料加热炉F-2201瓦斯进气自动阀TIV202\n" +
            "[P]-现场确认分馏炉停，并关闭分馏塔进料加热炉F-2201瓦斯进气手阀XV205\n" +
            "[P]-关加热炉鼓风机C-2201\n" +
            "[I]-关汽提塔T2201塔底蒸汽自动阀TIV201\n" +
            "[P]-关汽提塔T2201塔底蒸汽手阀XV210\n" +
            "[I]-开低分油去事故池开关阀KIV104，低分油改去事故池\n" +
            "[P]-关分馏塔回流泵P2201出口阀XV221   \n" +
            "[P]-停分馏塔回流泵P2201\n" +
            "[P]-关分馏塔回流泵P2201进口阀XV220\n" +
            "[P]-汇报主操“分馏塔回流泵P2201已停止” \n" +
            "[P]-关分馏塔底泵P2202出口阀XV226\n" +
            "[P]-停分馏塔底泵P2202\n" +
            "[P]-关分馏塔底泵P2202进口阀XV225\n" +
            "[P]-汇报主操“分馏塔底泵P2202已停止”";
    public static final String COM_5="[I]-关分馏塔T2201塔底蒸汽自动阀TIV201\n" +
            "[P]-关分馏塔T2201塔底蒸汽手阀XV210\n" +
            "[P]-关分馏塔进料加热炉F-2201瓦斯进气手阀XV205\n" +
            "[P]-关加热炉鼓风机C-2201\n" +
            "[P]-现场确认分馏炉停，并汇报主操“分馏塔进料加热炉已停止。”\n" +
            "[I]-开低分油去事故池开关阀KIV104，低分油改去事故池\n" +
            "[P]-关分馏塔底出口手阀XV225\n" +
            "[P]-关分馏塔顶气相出口手阀XV212\n" +
            "[P]-关分馏塔回流泵P2201出口阀XV221   \n" +
            "[P]-停分馏塔回流泵P2201\n" +
            "[P]-关分馏塔回流泵P2201进口阀XV220\n" +
            "[P]-汇报主操“分馏塔回流泵P2201已停止” \n" +
            "[P]-关分馏塔底泵P2202出口阀XV226  \n" +
            "[P]-停分馏塔底泵P2202\n" +
            "[P]-关分馏塔底泵P2202进口阀XV225\n" +
            "[P]-汇报主操“分馏塔底泵P2202已停止”";
    public static final String COM_6="[I]-启动0.7MPa/min连锁卸放装置紧急泄压\n" +
            "[P]-现场确认反应进料泵P2101停运，并关闭现场阀门XV105，XV106\n" +
            "[P]-关闭原料油罐出油手阀XV104\n" +
            "[P]-汇报主操“原料油泵P2101已停止，原料油罐已隔离。” \n" +
            "[I]-打开原料油罐顶部消防水喷淋阀KIV101进行罐体冷却。\n" +
            "[P]-打开消防蒸汽软管站蒸汽阀XV152用消防蒸汽带灭火";
    public static final String COM_7="[P]-关分馏塔进料加热炉F-2201瓦斯进气手阀XV205\n" +
            "[P]-关加热炉鼓风机C-2201\n" +
            "[P]-现场确认分馏炉停，并汇报主操“分馏塔进料加热炉已停止。”\n" +
            "[P]-关分馏塔T2201塔底蒸汽手阀XV210\n" +
            "[P]-关原料油泵P2101出口阀XV106  \n" +
            "[P]-停原料油泵P2101\n" +
            "[P]-关原料油泵P2101进口阀XV105\n" +
            "[P]-汇报主操“原料油泵P2101已停止” \n" +
            "[P]-关分馏塔回流泵P2201出口阀XV221   \n" +
            "[P]-停分馏塔回流泵P2201\n" +
            "[P]-关分馏塔回流泵P2201进口阀XV220\n" +
            "[P]-汇报主操“分馏塔回流泵P2201已停止” \n" +
            "[P]-关分馏塔底泵P2202出口阀XV226  \n" +
            "[P]-停分馏塔底泵P2202\n" +
            "[P]-关分馏塔底泵P2202进口阀XV225\n" +
            "[P]-汇报主操“分馏塔底泵P2202已停止”";
    public static final String COM_8="[I]-启动0.7MPa/min连锁卸放装置紧急泄压\n" +
            "[P]-现场确认反应进料泵P2101停运，并关闭现场阀门XV105，XV106\n" +
            "[P]-汇报主操“原料油泵P2101已停止”\n" +
            "[P]-关闭着火点前手阀XV112\n" +
            "[I]-打开反应器顶部法兰消防蒸汽灭火圈自动阀KIV102进行蒸汽隔离灭火";
    public static final String COM_9="[I]-关分馏塔进料加热炉F-2201瓦斯进气自动阀TIV202\n" +
            "[P]-关分馏塔进料加热炉F-2201瓦斯进气手阀XV205\n" +
            "[P]-汇报主操“分馏塔进料加热炉燃料气已断开。”\n" +
            "[P]-关加热炉鼓风机C-2201\n" +
            "[I]-关分馏塔T2201塔底蒸汽自动阀TIV201\n" +
            "[P]-关分馏塔T2201塔底蒸汽手阀XV210\n" +
            "[I]-开低分油去事故池开关阀KIV104，低分油改去事故池\n" +
            "[P]-关分馏塔回流泵P2201出口阀XV221   \n" +
            "[P]-停分馏塔回流泵P2201\n" +
            "[P]-关分馏塔回流泵P2201进口阀XV220\n" +
            "[P]-汇报主操“分馏塔回流泵P2201已停止” \n" +
            "[P]-关分馏塔底泵P2202出口阀XV226  \n" +
            "[P]-停分馏塔底泵P2202\n" +
            "[P]-关分馏塔底泵P2202进口阀XV225\n" +
            "[P]-汇报主操“分馏塔底泵P2202已停止”";
}
